---

C#Visual BasicVisual C++

Revit 2024 API
---
Alignment..::..GetClosestStation Method
Alignment Class See Also Send Feedback
---

Calculates the alignment station closest to the given model point.

**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1

# Syntax

C#
---

    public double GetClosestStation(
    	XYZ point
    )

Visual Basic
---

    Public Function GetClosestStation ( _
    	point As XYZ _
    ) As Double

Visual C++
---

    public:
    double GetClosestStation(
    	XYZ^ point
    )

#### Parameters

point
    Type: Autodesk.Revit.DB..::..XYZThe model point for which to calculate the closest station.

#### Return Value

The alignment station closest to the given model point, in Revit internal model units (standard Imperial feet).

# See Also

Alignment Class

Autodesk.Revit.DB.Infrastructure Namespace